[
  {
    "company": "Rabobank",
    "url": "https://www.rabobank.nl/",
    "position": "Frontend Developer - Design Systems",
    "location": "Barcelona, Spain",
    "type": "Hybrid",
    "startYear": "2021",
    "endYear": "2024",
    "summary": "My team and I were responsible for maintaining and expanding the component and styling library for the Rabobank - one of the largest banks in the Netherlands. The Design System is used by over 150 different frontend teams.",
    "responsibilities": [
      "Implementing new web components and styling features with close collaboration with the design team",
      "Providing technical support for other developers that use our library",
      "Creating and maintaining CI/CD pipelines in Azure DevOps",
      "Building developer tools to improve the developer experience",
      "Writing extensive documentation for all features in the library",
      "Maintinging a zero-bug policy for the library",
      "Bi-weekly demos, presentations and workshops for users and stakeholders"
    ],
    "achievements": [
      "Implementing dark-mode theme for the complete component and styling library",
      "Complete overhaul of legacy styling library to a new tokenized structure for theming"
    ],
    "stack": [
      "StencilJS",
      "Lit",
      "TypeScript",
      "Sass",
      "Storybook",
      "WebdriverIO",
      "Jest",
      "Azure DevOps"
    ]
  },
  {
    "company": "Zeelo",
    "url": "https://www.zeelo.co/",
    "position": "Frontend Developer",
    "location": "Barcelona, Spain",
    "type": "Remote",
    "startYear": "2021",
    "endYear": "2021",
    "summary": "Zeelo is a bus sharing company functioning as a SaaS platform, build with ReactJS and NodeJS for the frontend.",
    "responsibilities": [
      "Building and maintaining features for the in-house agents",
      "Creating new features for the customer-facing website",
      "Writing middleware to connect the frontend with the backend"
    ],
    "stack": ["ReactJS", "TypeScript", "NodeJS", "Storybook"]
  },
  {
    "company": "LeoVegas",
    "url": "https://www.leovegas.com/",
    "position": "Javascript Engineer",
    "location": "Stockholm, Sweden",
    "type": "On-site",
    "startYear": "2018",
    "endYear": "2020",
    "summary": "LeoVegas is an online casino provider hosting slot games, live-casino and sportsbetting. The platform is a ReactJS application with a NodeJS backend connected through a GraphQL API layer.",
    "responsibilities": [
      "Maintaining and improving the slot games and live-casino user interfaces for various providers",
      "Close collaboration with backend developers to improve the API layer",
      "Implementing various A/B tests to improve user engagement and retention",
      "Improving the customer-support services by refactoring the chat feature and FAQ section",
      "Ensuring the ever-changing gambling regulations are implemented correctly"
    ],
    "achievements": [
      "Built and lead the industry first 'Multiplay' feature to play multiple slot games at once",
      "Created a tournaments feature for the casino platform with real-time leaderboards",
      "Built in-app questionaires to gather user feedback and improve the product with rewards for users"
    ],
    "stack": ["ReactJS", "TypeScript", "NodeJS", "Storybook", "GraphQL"]
  }
]
