[
  {
    "company": "Rabobank",
    "url": "https://www.rabobank.nl/",
    "position": "Frontend Developer - Design Systems",
    "location": "Barcelona, Spain",
    "type": "Hybrid",
    "startYear": "2021",
    "endYear": "2024",
    "summary": "My team and I were responsible for maintaining and expanding the component and styling library for the Rabobank - one of the largest banks in the Netherlands. The Design System is used by over 150 different frontend teams.",
    "responsibilities": [
      "Implementing new web components and styling features",
      "Providing technical support for other developers that use our library",
      "Maintinging a zero-bug policy for the library",
      "Writing extensive documentation for all features in the library",
      "Bi-weekly demos, presentations and workshops for users and stakeholders"
    ],
    "achievements": [
      "Implementing dark-mode theme for the complete component and styling library",
      "Complete overhaul of legacy styling library to a new tokenized structure for theming"
    ],
    "stack": [
      "StencilJS",
      "Lit",
      "TypeScript",
      "Sass",
      "Storybook",
      "WebdriverIO",
      "Jest",
      "Azure DevOps"
    ]
  },
  {
    "company": "Zeelo",
    "url": "https://www.zeelo.co/",
    "position": "Frontend Developer",
    "location": "Barcelona, Spain",
    "type": "Remote",
    "startYear": "2021",
    "endYear": "2021",
    "summary": "Zeelo is a bus sharing company functioning as a SaaS platform. My main focus while working here was on improving and adding features to the internal tools, which are used on a daily basis by operators. The platform is built with React and uses an inhouse UI library created with Styled-Components powered by Storybook.",
    "responsibilities": ["Highlight 1", "Highlight 2"],
    "achievements": ["Achievement 1", "Achievement 2"],
    "stack": ["ReactJS", "TypeScript", "NodeJS", "Storybook"]
  },
  {
    "company": "LeoVegas",
    "url": "https://www.leovegas.com/",
    "position": "Javascript Engineer",
    "location": "Stockholm, Sweden",
    "type": "On-site",
    "startYear": "2018",
    "endYear": "2020",
    "summary": "LeoVegas is an online casino provider. My daily job includes developing new features, especially to enhance the game experience for players. I work with React.js, Node.js and GraphQL on a daily basis. Other responsibilities include writing tests for the features we develop, maintain and bug-fix any feature previously released, and close collaboration between designers and BackEnd developers. In my nearly 3 years at LeoVegas, I have gone from junior to senior within the company. I functioned as interim team-lead for 4 months, where I guided the project from start to finish while coding and managing team members and stakeholders.",
    "responsibilities": ["Highlight 1", "Highlight 2"],
    "achievements": ["Achievement 1", "Achievement 2"],
    "stack": ["ReactJS", "TypeScript", "NodeJS", "Storybook", "GraphQL"]
  }
]
